blog/2022/10/outsourcing-nixos-compile-time-to-microsoft/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Outsourcing NixOS compile time to Microsoft</title>
<meta name="author" content="Elis Hirwing &lt;elis@hirwing.se&gt;" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/style.css" />
<link rel="alternate" type="application/rss+xml" title="~elis/blog/" href="/blog/rss.xml" />
<link rel="icon" href="/imgs/favicon.jpg">
<link rel="me" href="https://chaos.social/@sa0bse" />
<meta name="referrer" content="no-referrer" />
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="preamble" class="status">
<nav>
     <ul>
       <li><a href="/">~elis/</a></li>
       <li><a href="/about/">./about/</a></li>
       <li><a href="/work/">./work/</a></li>
       <li><a href="/talks/">./talks/</a></li>
       <li><a href="/blog/">./blog/</a></li>
     </ul>
   </nav>
</div>
<div id="content" class="content">
<h1 class="title">Outsourcing NixOS compile time to Microsoft</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="/blog/2022/10/outsourcing-nixos-compile-time-to-microsoft/#my-first-approach">My first approach (using a remote builder)</a></li>
<li><a href="/blog/2022/10/outsourcing-nixos-compile-time-to-microsoft/#outsourcing-the-builds-to-microsoft">Outsourcing the builds to Microsoft (using GitHub actions and cachix)</a>
<ul>
<li><a href="/blog/2022/10/outsourcing-nixos-compile-time-to-microsoft/#caching-all-systems-on-your-main-branch">Caching all systems on your main branch</a></li>
<li><a href="/blog/2022/10/outsourcing-nixos-compile-time-to-microsoft/#automating-updates-of-the-main-branch">Automating updates of the main branch</a></li>
<li><a href="/blog/2022/10/outsourcing-nixos-compile-time-to-microsoft/#but-wait-you-have-encrypted-secrets-in-your-repo">But wait, you have encrypted secrets in your repo</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="https://nixos.org">NixOS</a> is a Linux-distribution that may be source-based, but it has a binary
cache that covers things so you generally don't need to compile things,
things tends to be cached.
</p>

<p>
However, depending on how you configure your system, you may trigger compiles
depending on what you do.
</p>

<p>
So a thing I do is that I run Emacs 29 with the native-comp patches that is
wayland native with the pgtk-branch. This is by no mean the stable Emacs
release at the point of writing. So to get this Emacs I use the excellent
<a href="https://github.com/nix-community/emacs-overlay">nix-community/emacs-overlay</a> (that is maintained by my friend
<a href="https://github.com/adisbladis">@adisbladis</a>). However, this means that I will get Emacs from a development
branch of Emacs, then I need to build all the Emacs packages that I use in my
configuration as well for this version of Emacs.
</p>

<p>
Emacs with native comp is also quite slow to build. So building it… takes
time… and I need the Emacs built on two laptops for different use.
</p>

<article id="outline-container-my-first-approach" class="outline-2">
<h2 id="my-first-approach">My first approach (using a remote builder)</h2>
<div class="outline-text-2" id="text-my-first-approach">
<p>
So I started by using my home server as a remote builder on both laptops,
this way… most of the time Emacs would be compiled on the remote builder… so
when one system had been updated and the second system would try to do the
same build on the same server… it would been cached there and not needed
building.
</p>

<p>
This was pretty simple, this didn't take much time to set up… but not a
proper binary cache and wouldn't always match due to the chance of not
running that build on the remote system.
</p>

<p>
However it worked for quite some time, but it had side-effects… like… when I
started the build I still had to wait for it to complete… and more notably
now compared to before. I'm the one paying the power draw for the home
server.
</p>
</div>
</article>

<article id="outline-container-outsourcing-the-builds-to-microsoft" class="outline-2">
<h2 id="outsourcing-the-builds-to-microsoft">Outsourcing the builds to Microsoft (using GitHub actions and cachix)</h2>
<div class="outline-text-2" id="text-outsourcing-the-builds-to-microsoft">
<p>
So with this I had to set up and use a proper binary cache, I decided to give
<a href="https://cachix.org">cachix</a> a try (haven't managed it myself before). I must say it's really nice.
It's really easy to push builds there and then you have it as a binary cache
on your system and just get the pushed builds. It's also free to use for open
source projects and you can cache up to 5GiB data (and it won't cache things
that are in the cache.nixos.org cache) so it's really plenty enough for me.
</p>

<p>
So first, go to cachix, then you need to configure your systems to use cachix
like this:
</p>
<div class="org-src-container">
<pre class="src src-nix">{
  <span class="org-comment"># &#8230;</span>

  <span class="org-nix-attribute">nix.settings.substituters</span> = [
    <span class="org-string">"https://YOURNAME.cachix.org"</span>
  ];

  <span class="org-nix-attribute">nix.settings.trusted-public-keys</span> = [
    <span class="org-string">"YOURNAME.cachix.org-&#8230;"</span>
  ];

  <span class="org-comment"># &#8230;</span>
}
</pre>
</div>
</div>

<div id="outline-container-caching-all-systems-on-your-main-branch" class="outline-3">
<h3 id="caching-all-systems-on-your-main-branch">Caching all systems on your main branch</h3>
<div class="outline-text-3" id="text-caching-all-systems-on-your-main-branch">
<p>
This is really quite simple, you create a <a href="https://app.cachix.org/personal-auth-tokens">Personal Access Token</a> at cachix and
then you create a GitHub workflow in your repository. So I just created the
file named <code>.github/workflows/cachix.yml</code>:
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">name</span>: Cachix

<span class="org-constant">on</span>:
  <span class="org-variable-name">push</span>:
    <span class="org-variable-name">branches</span>:
      - main

<span class="org-variable-name">jobs</span>:
  <span class="org-variable-name">build</span>:
    <span class="org-variable-name">runs-on</span>: ubuntu-20.04
    <span class="org-variable-name">steps</span>:
      <span class="org-comment-delimiter"># </span><span class="org-comment">Clone repo</span>
      - <span class="org-variable-name">uses</span>: actions/checkout@v3
<span class="org-yaml-tab">        </span><span class="org-variable-name">with</span>:
<span class="org-yaml-tab">        </span><span class="org-variable-name">  submodules</span>: recursive
      <span class="org-comment-delimiter"># </span><span class="org-comment">Install nix</span>
      - <span class="org-variable-name">uses</span>: cachix/install-nix-action@v18
      - <span class="org-variable-name">name</span>: Cachix setup
<span class="org-yaml-tab">        </span><span class="org-variable-name">uses</span>: cachix/cachix-action@v12
<span class="org-yaml-tab">        </span><span class="org-variable-name">with</span>:
<span class="org-yaml-tab">        </span><span class="org-variable-name">  name</span>: YOURNAME
<span class="org-yaml-tab">        </span>  <span class="org-comment-delimiter"># </span><span class="org-comment">you need to create the secret named CACHIX_AUTH_TOKEN</span>
<span class="org-yaml-tab">        </span>  <span class="org-comment-delimiter"># </span><span class="org-comment">with the personal access token created.</span>
<span class="org-yaml-tab">        </span><span class="org-variable-name">  authToken</span>: <span class="org-string">'${{ secrets.CACHIX_AUTH_TOKEN }}'</span>
<span class="org-yaml-tab">        </span><span class="org-variable-name">  skipPush</span>: <span class="org-constant">true</span>

      <span class="org-comment-delimiter"># </span><span class="org-comment">Build a configuration.nix file that doesn't use flakes</span>
      <span class="org-comment-delimiter"># </span><span class="org-comment">and push to cachix.</span>
      - <span class="org-variable-name">name</span>: Build private-laptop system derivation
<span class="org-yaml-tab">        </span><span class="org-variable-name">run</span>: nix-build <span class="org-string">'&lt;nixpkgs/nixos&gt;'</span> -I nixos-config=./hosts/private-laptop/configuration.nix -I nixpkgs=./nix/nixos-unstable -A system
      - <span class="org-variable-name">name</span>: Cache private-laptop system derivation
<span class="org-yaml-tab">        </span><span class="org-variable-name">run</span>: realpath result | cachix push YOURNAME

      <span class="org-comment-delimiter"># </span><span class="org-comment">Add additional builds here&#8230;</span>
</pre>
</div>

<p>
This should be enough to make sure that you always have a cached main branch.
</p>
</div>
</div>

<div id="outline-container-automating-updates-of-the-main-branch" class="outline-3">
<h3 id="automating-updates-of-the-main-branch">Automating updates of the main branch</h3>
<div class="outline-text-3" id="text-automating-updates-of-the-main-branch">
<p>
This looks quite similar to the above, but it runs on a schedule and has an
additional step, which is to update nixpkgs and all other dependencies.
</p>

<p>
So I have a file named <code>.github/workflows/update.yml</code>
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">name</span>: Update

<span class="org-constant">on</span>:
  <span class="org-variable-name">schedule</span>:
    - <span class="org-variable-name">cron</span>: <span class="org-string">"30 3 * * 1,3,6"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">At 03:30 on Monday, Wednesday, and Saturday.</span>

<span class="org-variable-name">jobs</span>:
  <span class="org-variable-name">build</span>:
    <span class="org-variable-name">runs-on</span>: ubuntu-20.04
    <span class="org-variable-name">steps</span>:
      <span class="org-comment-delimiter"># </span><span class="org-comment">Clone repo</span>
      - <span class="org-variable-name">uses</span>: actions/checkout@v3
<span class="org-yaml-tab">        </span><span class="org-variable-name">with</span>:
<span class="org-yaml-tab">        </span><span class="org-variable-name">  submodules</span>: recursive
      <span class="org-comment-delimiter"># </span><span class="org-comment">Install nix</span>
      - <span class="org-variable-name">uses</span>: cachix/install-nix-action@v18
      - <span class="org-variable-name">name</span>: Cachix setup
<span class="org-yaml-tab">        </span><span class="org-variable-name">uses</span>: cachix/cachix-action@v12
<span class="org-yaml-tab">        </span><span class="org-variable-name">with</span>:
<span class="org-yaml-tab">        </span><span class="org-variable-name">  name</span>: YOURNAME
<span class="org-yaml-tab">        </span>  <span class="org-comment-delimiter"># </span><span class="org-comment">you need to create the secret named CACHIX_AUTH_TOKEN</span>
<span class="org-yaml-tab">        </span>  <span class="org-comment-delimiter"># </span><span class="org-comment">with the personal access token created.</span>
<span class="org-yaml-tab">        </span><span class="org-variable-name">  authToken</span>: <span class="org-string">'${{ secrets.CACHIX_AUTH_TOKEN }}'</span>
<span class="org-yaml-tab">        </span><span class="org-variable-name">  skipPush</span>: <span class="org-constant">true</span>

      <span class="org-comment-delimiter"># </span><span class="org-comment">Do updates of nixpkgs and other dependencies.</span>
      - <span class="org-variable-name">name</span>: Update all dependencies
<span class="org-yaml-tab">        </span><span class="org-variable-name">run</span>: nix-shell --run <span class="org-string">'make update-all'</span>
<span class="org-yaml-tab">        </span><span class="org-variable-name">env</span>:
<span class="org-yaml-tab">        </span><span class="org-variable-name">  NIX_PATH</span>: nixpkgs=./nix/nixos-unstable

      <span class="org-comment-delimiter"># </span><span class="org-comment">Build a configuration.nix file that doesn't use flakes</span>
      <span class="org-comment-delimiter"># </span><span class="org-comment">and push to cachix.</span>
      - <span class="org-variable-name">name</span>: Build private-laptop system derivation
<span class="org-yaml-tab">        </span><span class="org-variable-name">run</span>: nix-build <span class="org-string">'&lt;nixpkgs/nixos&gt;'</span> -I nixos-config=./hosts/private-laptop/configuration.nix -I nixpkgs=./nix/nixos-unstable -A system
      - <span class="org-variable-name">name</span>: Cache private-laptop system derivation
<span class="org-yaml-tab">        </span><span class="org-variable-name">run</span>: realpath result | cachix push YOURNAME

      <span class="org-comment-delimiter"># </span><span class="org-comment">Add additional builds here&#8230;</span>

      <span class="org-comment-delimiter"># </span><span class="org-comment">Finish up by commiting the changes if all builds worked.</span>
      - <span class="org-variable-name">uses</span>: stefanzweifel/git-auto-commit-action@v4.15.0
<span class="org-yaml-tab">        </span><span class="org-variable-name">with</span>:
<span class="org-yaml-tab">        </span><span class="org-variable-name">  commit_message</span>: <span class="org-string">"cron(treewide): Upgrade systems"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-but-wait-you-have-encrypted-secrets-in-your-repo" class="outline-3">
<h3 id="but-wait-you-have-encrypted-secrets-in-your-repo">But wait, you have encrypted secrets in your repo</h3>
<div class="outline-text-3" id="text-but-wait-you-have-encrypted-secrets-in-your-repo">
<p>
Yes, that's correct and I don't give GitHub a key to decrypt that or cache it
in cachix, however, I store those secrets in a file name <code>.data-secrets.nix</code>
in the root of the repo on my laptops. Then I read from that file when I
build. So what I do is that I added the following step before the builds on
GitHub:
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span class="org-comment-delimiter"># </span><span class="org-comment">Populate a fake secrets file.</span>
- <span class="org-variable-name">name</span>: Populate a fake secrets file
  <span class="org-variable-name">run</span>: echo <span class="org-string">'{ hashedEtuPassword = ""; }'</span> &gt; .data-secrets.nix
</pre>
</div>

<p>
This way the build will at least find empty strings and the keys will contain
something. So all the builds will succeed. This also means that it won't
cache all the things fully or properly. However, my secrets contains things
like hashed passwords and that shouldn't trigger any big compiles. So having
to build those things locally and symlink together the rest of the system
isn't a big deal.
</p>
</div>
</div>
</article>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-10-10 Mon 20:00</p>
<p class="author">Author: Elis Hirwing &lt;elis@hirwing.se&gt;</p>
</div>
</body>
</html>
